#!/usr/bin/env python3
import math
def katet():
    a = float(input('Введите значение первого катета:'))
    b = float(input('Введите значение второго катета'))
    if a <= 0 or b <= 0:
        print("Будь внимательнее! Числа должны быть положительными!")
    c =math.sqrt((a * a) + (b * b))
    return c

def gipotenusa():
    c = float(input('Введите значение гипотенузы:'))
    a = float(input('Введите значение известного катета:'))
    if a <= 0 or c <= 0:
        print('Будь внимательнее! числа должны быть положительными!!')
        return
    if a >= c:
        print('Плохо! Катет не может быть больше или равен гипотенузе!')
    b = math.sqrt((c * c) - (a * a))
    return b


if __name__ == '__main__':
    vybor = input('Выбери один из двух вариантов:\n 1. Найти гипотенузу (даны два катета)\n 2. Найти катет (дана гипотенуза и катет)\n')
    if vybor == '1':
        c = katet()
        print(f'Ваша искомая гипотенуза равна: {c}')
    elif vybor == '2':
        b = gipotenusa()
        print(f'Вот значение искомого катета:{b}')
    else:
        print('Вы явно выбрали чтото не то....')
